Chapter05/LoanOriginationApp/LoanOriginationProject/testsuites/CreditCheckPrj.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    	<soap:Body>
        		<ns1:LoanRequest xmlns:ns1="http://www.samplebank.org">
            			<ns1:LoanDetails>
                				<ns1:ApplicantID>1122</ns1:ApplicantID>
                				<ns1:Product>ABC1122</ns1:Product>
                				<ns1:Amount>1221</ns1:Amount>
                				<ns1:ApplicationDate>2014-12-12T00:00:00</ns1:ApplicationDate>
                				<ns1:Channel>WEB</ns1:Channel>
                				<ns1:Source>WEB</ns1:Source>
                				<ns1:InterestRate>1</ns1:InterestRate>
                				<ns1:UpdateDate>2014-12-12T00:00:00</ns1:UpdateDate>
                				<ns1:LoanOfficer>salesrep</ns1:LoanOfficer>
                				<ns1:LoanSalesRep>salesrep</ns1:LoanSalesRep>
                				<ns1:LoanProcessor>WEB</ns1:LoanProcessor>
                				<ns1:LoanStatus>NEW</ns1:LoanStatus>
                				<ns1:LoanPurpose>Home</ns1:LoanPurpose>
                				<ns1:Terms>30</ns1:Terms>
                				<ns1:PaymentFrequency>Quaterly</ns1:PaymentFrequency>
            </ns1:LoanDetails>
            			<ns1:ApplicantDetails>
                				<ns1:ApplicantInformation>
                    					<ns1:Salutation>Miss</ns1:Salutation>
                    					<ns1:FName>Christine</ns1:FName>
                    					<ns1:MName>R</ns1:MName>
                    					<ns1:LName>R</ns1:LName>
                    					<ns1:DateOfBirth>2014-12-12T00:00:00</ns1:DateOfBirth>
                    					<ns1:SSN_Or_TAX>12</ns1:SSN_Or_TAX>
                    					<ns1:ApplicantType>NEW</ns1:ApplicantType>
                    					<ns1:Gender>Female</ns1:Gender>
                    					<ns1:MaritialStatus>Single</ns1:MaritialStatus>
                    					<ns1:Nationality>UK</ns1:Nationality>
                    					<ns1:Attribute1>A1</ns1:Attribute1>
                    					<ns1:Attribute2>A2</ns1:Attribute2>
                </ns1:ApplicantInformation>
                				<ns1:Address>
                    					<ns1:Line1>Address Line 1</ns1:Line1>
                    					<ns1:Line2>Line 2</ns1:Line2>
                    					<ns1:City>Miami</ns1:City>
                    					<ns1:County>UK</ns1:County>
                    					<ns1:State>FL</ns1:State>
                    					<ns1:Country>UK</ns1:Country>
                    					<ns1:Zip>33333</ns1:Zip>
                    					<ns1:LivingSince>2014-12-12T00:00:00</ns1:LivingSince>
                </ns1:Address>
                				<ns1:Contact>
                    					<ns1:Email>a@b.com</ns1:Email>
                    					<ns1:HomePhone>12345</ns1:HomePhone>
                    					<ns1:WorkPhone>54321</ns1:WorkPhone>
                    					<ns1:CellPhone>12345</ns1:CellPhone>
                    					<ns1:Fax>54321</ns1:Fax>
                </ns1:Contact>
                				<ns1:IncomeEmployment>
                    					<ns1:Occupation>IT</ns1:Occupation>
                    					<ns1:YGross>20000000000</ns1:YGross>
                    					<ns1:TotalIncome>20000000000</ns1:TotalIncome>
                    					<ns1:EmployeeName>SOmeName</ns1:EmployeeName>
                    					<ns1:JobTitle>Consultant</ns1:JobTitle>
                    					<ns1:StartDate>2014-12-12T00:00:00</ns1:StartDate>
                    					<ns1:EndDate>2014-12-12T00:00:00</ns1:EndDate>
                    					<ns1:EmployeePhone>1234554321</ns1:EmployeePhone>
                    					<ns1:EmployeeAddress>Some Address</ns1:EmployeeAddress>
                </ns1:IncomeEmployment>
            </ns1:ApplicantDetails>
            			<ns1:LoanStatus>NEW</ns1:LoanStatus>
        </ns1:LoanRequest>
    </soap:Body>
</soap:Envelope>
