Chapter05/LoanOriginationApp/LoanOriginationProject/testsuites/FraudCheckPrj.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    	<soap:Body>
        		<ns1:LoanRequest xmlns:ns1="http://www.samplebank.org">
            			<ns1:LoanDetails>
                				<ns1:ApplicantID>1</ns1:ApplicantID>
                				<ns1:Product>1</ns1:Product>
                				<ns1:Amount>1</ns1:Amount>
                				<ns1:ApplicationDate>2014-12-12T00:00:00</ns1:ApplicationDate>
                				<ns1:Channel>1</ns1:Channel>
                				<ns1:Source>1</ns1:Source>
                				<ns1:InterestRate>1</ns1:InterestRate>
                				<ns1:UpdateDate>2014-12-12T00:00:00</ns1:UpdateDate>
                				<ns1:LoanOfficer>1</ns1:LoanOfficer>
                				<ns1:LoanSalesRep>1</ns1:LoanSalesRep>
                				<ns1:LoanProcessor>1</ns1:LoanProcessor>
                				<ns1:LoanStatus>1</ns1:LoanStatus>
                				<ns1:LoanPurpose>1</ns1:LoanPurpose>
                				<ns1:Terms>1</ns1:Terms>
                				<ns1:PaymentFrequency>1</ns1:PaymentFrequency>
            </ns1:LoanDetails>
            			<ns1:ApplicantDetails>
                				<ns1:ApplicantInformation>
                    					<ns1:Salutation>1</ns1:Salutation>
                    					<ns1:FName>1</ns1:FName>
                    					<ns1:MName>1</ns1:MName>
                    					<ns1:LName>1</ns1:LName>
                    					<ns1:DateOfBirth>2014-12-12T00:00:00</ns1:DateOfBirth>
                    					<ns1:SSN_Or_TAX>1</ns1:SSN_Or_TAX>
                    					<ns1:ApplicantType>1</ns1:ApplicantType>
                    					<ns1:Gender>1</ns1:Gender>
                    					<ns1:MaritialStatus>1</ns1:MaritialStatus>
                    					<ns1:Nationality>1</ns1:Nationality>
                    					<ns1:Attribute1>1</ns1:Attribute1>
                    					<ns1:Attribute2>1</ns1:Attribute2>
                </ns1:ApplicantInformation>
                				<ns1:Address>
                    					<ns1:Line1>a</ns1:Line1>
                    					<ns1:Line2>a</ns1:Line2>
                    					<ns1:City>a</ns1:City>
                    					<ns1:County>a</ns1:County>
                    					<ns1:State>a</ns1:State>
                    					<ns1:Country>a</ns1:Country>
                    					<ns1:Zip>33333</ns1:Zip>
                    					<ns1:LivingSince>2014-12-12T00:00:00</ns1:LivingSince>
                </ns1:Address>
                				<ns1:Contact>
                    					<ns1:Email>a@b.com</ns1:Email>
                    					<ns1:HomePhone>12345</ns1:HomePhone>
                    					<ns1:WorkPhone>12345</ns1:WorkPhone>
                    					<ns1:CellPhone>12345</ns1:CellPhone>
                    					<ns1:Fax>12345</ns1:Fax>
                </ns1:Contact>
                				<ns1:IncomeEmployment>
                    					<ns1:Occupation>1</ns1:Occupation>
                    					<ns1:YGross>1</ns1:YGross>
                    					<ns1:TotalIncome>1</ns1:TotalIncome>
                    					<ns1:EmployeeName>1</ns1:EmployeeName>
                    					<ns1:JobTitle>1</ns1:JobTitle>
                    					<ns1:StartDate>2014-12-12T00:00:00</ns1:StartDate>
                    					<ns1:EndDate>2014-12-12T00:00:00</ns1:EndDate>
                    					<ns1:EmployeePhone>1</ns1:EmployeePhone>
                    					<ns1:EmployeeAddress>1</ns1:EmployeeAddress>
                </ns1:IncomeEmployment>
            </ns1:ApplicantDetails>
            			<ns1:LoanStatus>NEW</ns1:LoanStatus>
        </ns1:LoanRequest>
    </soap:Body>
</soap:Envelope>
